burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_syscfg.h
/*!
    \file    GD32M53X_syscfg.h
    \brief   definitions for the SYSCFG

    \version 2026-03-04, V1.0.0, firmware for GD32M53x
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32M53X_SYSCFG_H
#define GD32M53X_SYSCFG_H

#include "gd32m53x.h"

/* SYSCFG definitions */
#define SYSCFG                              SYSCFG_BASE                                     /*!< SYSCFG base address */

/* registers definitions */
#define SYSCFG_CFG0                         REG32(SYSCFG + 0x00000000U)                     /*!< Configuration register 0 */
#define SYSCFG_CFG1                         REG32(SYSCFG + 0x00000004U)                     /*!< Configuration register 1 */
#define SYSCFG_EXTISS0                      REG32(SYSCFG + 0x00000008U)                     /*!< EXTI sources selection register 0 */
#define SYSCFG_EXTISS1                      REG32(SYSCFG + 0x0000000CU)                     /*!< EXTI sources selection register 1 */
#define SYSCFG_EXTISS2                      REG32(SYSCFG + 0x00000010U)                     /*!< EXTI sources selection register 2 */
#define SYSCFG_EXTISS3                      REG32(SYSCFG + 0x00000014U)                     /*!< EXTI sources selection register 3 */
#define SYSCFG_STAT                         REG32(SYSCFG + 0x0000001CU)                     /*!< Status register */
#define SYSCFG_CFG2                         REG32(SYSCFG + 0x00000020U)                     /*!< Configuration register 2 */
#define SYSCFG_CFG3                         REG32(SYSCFG + 0x00000024U)                     /*!< Configuration register 3 */
#define SYSCFG_CFG4                         REG32(SYSCFG + 0x00000028U)                     /*!< Configuration register 4 */
#define SYSCFG_TIMERCISEL0                  REG32(SYSCFG + 0x00000034U)                     /*!< TIMER input selection register 0 */
#define SYSCFG_TIMERCISEL1                  REG32(SYSCFG + 0x00000038U)                     /*!< TIMER input selection register 1 */
#define SYSCFG_CFG5                         REG32(SYSCFG + 0x00000054U)                     /*!< Configuration register 5 */
#define SYSCFG_SRAMCFG                      REG32(SYSCFG + 0x00000068U)                     /*!< SRAM configuration register */
#define SYSCFG_PRCFG                        REG32(SYSCFG + 0x0000006CU)                     /*!< Protect configuration register */
#define SYSCFG_TADSRCFG                     REG32(SYSCFG + 0x00000070U)                     /*!< TIMERx ADC start request configuration register */
#define SYSCFG_TIMER0TRGCFG0                REG32(SYSCFG + 0x00000100U)                     /*!< TIMER0 configuration register 0 */
#define SYSCFG_TIMER0TRGCFG1                REG32(SYSCFG + 0x00000104U)                     /*!< TIMER0 configuration register 1 */
#define SYSCFG_TIMER0TRGCFG2                REG32(SYSCFG + 0x00000108U)                     /*!< TIMER0 configuration register 2 */
#define SYSCFG_TIMER1TRGCFG0                REG32(SYSCFG + 0x0000010CU)                     /*!< TIMER1 configuration register 0 */
#define SYSCFG_TIMER1TRGCFG1                REG32(SYSCFG + 0x00000110U)                     /*!< TIMER1 configuration register 1 */
#define SYSCFG_TIMER1TRGCFG2                REG32(SYSCFG + 0x00000114U)                     /*!< TIMER1 configuration register 2 */
#define SYSCFG_TIMER2TRGCFG0                REG32(SYSCFG + 0x00000118U)                     /*!< TIMER2 configuration register 0 */
#define SYSCFG_TIMER2TRGCFG1                REG32(SYSCFG + 0x0000011CU)                     /*!< TIMER2 configuration register 1 */
#define SYSCFG_TIMER2TRGCFG2                REG32(SYSCFG + 0x00000120U)                     /*!< TIMER2 configuration register 2 */
#define SYSCFG_TIMER7TRGCFG0                REG32(SYSCFG + 0x00000124U)                     /*!< TIMER7 configuration register 0 */
#define SYSCFG_TIMER7TRGCFG1                REG32(SYSCFG + 0x00000128U)                     /*!< TIMER7 configuration register 1 */
#define SYSCFG_TIMER7TRGCFG2                REG32(SYSCFG + 0x0000012CU)                     /*!< TIMER7 configuration register 2 */
#define SYSCFG_CFG6                         REG32(SYSCFG + 0x00000204U)                     /*!< Configuration register 6 */

/* SYSCFG_CFG0 bits definitions */
#define SYSCFG_CFG0_BOOT_MODE               BITS(0,1)                                       /*!< BOOT mode */

/* SYSCFG_CFG1 bits definitions */
#define SYSCFG_CFG1_I2CFMPEN                BIT(0)                                          /*!< I2C fast mode plus enable */

