burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_syscfg.h
/* SYSCFG_EXTISS0 bits definitions */
#define SYSCFG_EXTISS0_EXTI0_SS             BITS(0,3)                                       /*!< EXTI 0 configuration */
#define SYSCFG_EXTISS0_EXTI1_SS             BITS(4,7)                                       /*!< EXTI 1 configuration */
#define SYSCFG_EXTISS0_EXTI2_SS             BITS(8,11)                                      /*!< EXTI 2 configuration */
#define SYSCFG_EXTISS0_EXTI3_SS             BITS(12,15)                                     /*!< EXTI 3 configuration */

/* SYSCFG_EXTISS1 bits definitions */
#define SYSCFG_EXTISS1_EXTI4_SS             BITS(0,3)                                       /*!< EXTI 4 configuration */
#define SYSCFG_EXTISS1_EXTI5_SS             BITS(4,7)                                       /*!< EXTI 5 configuration */
#define SYSCFG_EXTISS1_EXTI6_SS             BITS(8,11)                                      /*!< EXTI 6 configuration */
#define SYSCFG_EXTISS1_EXTI7_SS             BITS(12,15)                                     /*!< EXTI 7 configuration */

/* SYSCFG_EXTISS2 bits definitions */
#define SYSCFG_EXTISS2_EXTI8_SS             BITS(0,3)                                       /*!< EXTI 8 configuration */
#define SYSCFG_EXTISS2_EXTI9_SS             BITS(4,7)                                       /*!< EXTI 9 configuration */
#define SYSCFG_EXTISS2_EXTI10_SS            BITS(8,11)                                      /*!< EXTI 10 configuration */
#define SYSCFG_EXTISS2_EXTI11_SS            BITS(12,15)                                     /*!< EXTI 11 configuration */

/* SYSCFG_EXTISS3 bits definitions */
#define SYSCFG_EXTISS3_EXTI12_SS            BITS(0,3)                                       /*!< EXTI 12 configuration */
#define SYSCFG_EXTISS3_EXTI13_SS            BITS(4,7)                                       /*!< EXTI 13 configuration */
#define SYSCFG_EXTISS3_EXTI14_SS            BITS(8,11)                                      /*!< EXTI 14 configuration */
#define SYSCFG_EXTISS3_EXTI15_SS            BITS(12,15)                                     /*!< EXTI 15 configuration */

/* SYSCFG_STAT bits definitions */
#define SYSCFG_STAT_ECCMEIF0                BIT(0)                                          /*!< SRAM ECC multi-bit error flag */
#define SYSCFG_STAT_ECCSEIF0                BIT(1)                                          /*!< SRAM ECC single-bit error flag */
#define SYSCFG_STAT_ECCMEIF1                BIT(2)                                          /*!< CAN SRAM ECC multi-bit error flag */
#define SYSCFG_STAT_ECCSEIF1                BIT(3)                                          /*!< CAN SRAM ECC single-bit error flag */
#define SYSCFG_STAT_ECCMEIF2                BIT(4)                                          /*!< CAN filter SRAM ECC multi-bit error flag */
#define SYSCFG_STAT_ECCSEIF2                BIT(5)                                          /*!< CAN filter SRAM ECC single-bit error flag */
#define SYSCFG_STAT_ECCMEIF3                BIT(6)                                          /*!< Flash SRAM ECC multi-bit error flag */
#define SYSCFG_STAT_ECCSEIF3                BIT(7)                                          /*!< Flash SRAM ECC single-bit error flag */
#define SYSCFG_STAT_ECCMEIF4                BIT(8)                                          /*!< Flash ECC multi-bit error flag */
#define SYSCFG_STAT_HXTAL_NMIIF             BIT(26)                                         /*!< HXTAL clock monitor NMI interrupt flag */
#define SYSCFG_STAT_PIN_NMIIF               BIT(27)                                         /*!< Interrupt flag from NMI pin */
#define SYSCFG_STAT_WWDGT_NMIIF             BIT(28)                                         /*!< WWDGT NMI interrupt flag */
#define SYSCFG_STAT_FWDGT_NMIIF             BIT(29)                                         /*!< FWDGT NMI interrupt flag */

/* SYSCFG_CFG2 bits definitions */
#define SYSCFG_CFG2_ECCMEIE0                BIT(0)                                          /*!< SRAM multi-bit non-correction interrupt enable */
#define SYSCFG_CFG2_ECCSEIE0                BIT(1)                                          /*!< SRAM single-bit correction interrupt enable */
#define SYSCFG_CFG2_HXTAL_NMIIE             BIT(3)                                          /*!< HXTAL clock monitor NMI interrupt enable */
#define SYSCFG_CFG2_PIN_NMIIE               BIT(4)                                          /*!< Interrupt flag from NMI pin interrupt enable */
#define SYSCFG_CFG2_WWDGT_NMISEL            BIT(6)                                          /*!< WWDGT NMI interrupt type select */
#define SYSCFG_CFG2_FWDGT_NMISEL            BIT(7)                                          /*!< FWDGT NMI interrupt type select */
#define SYSCFG_CFG2_LVD2_NMIIE              BIT(8)                                          /*!< Low Voltage Detectors2 NMI interrupt enable */
#define SYSCFG_CFG2_LVD1_NMIIE              BIT(9)                                          /*!< Low Voltage Detectors1 NMI interrupt enable */
#define SYSCFG_CFG2_ECCSEBIT                BITS(10,15)                                     /*!< Which one bit has an ECC single-bit correction error */
#define SYSCFG_CFG2_ECCEADDR                BITS(19,31)                                     /*!< Indicates the last ECC event on SRAMC occurred */

/* SYSCFG_CFG3 bits definitions */
#define SYSCFG_CFG3_ECCMEIE1                BIT(0)                                          /*!< CAN receive FIFO SRAM multi-bit non-correction interrupt enable */
#define SYSCFG_CFG3_ECCSEIE1                BIT(1)                                          /*!< CAN receive FIFO SRAM single-bit correction interrupt enable */
#define SYSCFG_CFG3_ECCMEIE2                BIT(2)                                          /*!< CAN filter SRAM multi-bit non-correction interrupt enable */
#define SYSCFG_CFG3_ECCSEIE2                BIT(3)                                          /*!< CAN filter SRAM single-bit correction interrupt enable */

/* SYSCFG_CFG4 bits definitions */
#define SYSCFG_CFG4_ECCMEIE3                BIT(0)                                          /*!< FLASH SRAM multi-bit non-correction interrupt enable */
#define SYSCFG_CFG4_ECCSEIE3                BIT(1)                                          /*!< FLASH SRAM single-bit correction interrupt enable */
#define SYSCFG_CFG4_ECCMEIE4                BIT(2)                                          /*!< FLASH multi-bit non-correction interrupt enable */

/* SYSCFG_TIMERCISEL0 bits definitions */
#define SYSCFG_TIMER7_CI0_SEL               BITS(0,3)                                       /*!< TIMER7_CI0 input selection */
#define SYSCFG_TIMER7_CI1_SEL               BITS(4,7)                                       /*!< TIMER7_CI1 input selection */
#define SYSCFG_TIMER7_CI2_SEL               BITS(8,11)                                      /*!< TIMER7_CI2 input selection */
#define SYSCFG_TIMER7_CI3_SEL               BITS(12,15)                                     /*!< TIMER7_CI3 input selection */
#define SYSCFG_TIMER0_CI0_SEL               BITS(16,19)                                     /*!< TIMER0_CI0 input selection */
#define SYSCFG_TIMER0_CI1_SEL               BITS(20,23)                                     /*!< TIMER0_CI1 input selection */
#define SYSCFG_TIMER0_CI2_SEL               BITS(24,27)                                     /*!< TIMER0_CI2 input selection */
#define SYSCFG_TIMER0_CI3_SEL               BITS(28,31)                                     /*!< TIMER0_CI3 input selection */

