burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_syscfg.h
/* SYSCFG_TIMERCISEL1 bits definitions */
#define SYSCFG_TIMER2_CI0_SEL               BITS(0,3)                                       /*!< TIMER2_CI0 input selection */
#define SYSCFG_TIMER2_CI1_SEL               BITS(4,7)                                       /*!< TIMER2_CI1 input selection */
#define SYSCFG_TIMER2_CI2_SEL               BITS(8,11)                                      /*!< TIMER2_CI2 input selection */
#define SYSCFG_TIMER2_CI3_SEL               BITS(12,15)                                     /*!< TIMER2_CI3 input selection */
#define SYSCFG_TIMER1_CI0_SEL               BITS(16,19)                                     /*!< TIMER1_CI0 input selection */
#define SYSCFG_TIMER1_CI1_SEL               BITS(20,23)                                     /*!< TIMER1_CI1 input selection */
#define SYSCFG_TIMER1_CI2_SEL               BITS(24,27)                                     /*!< TIMER1_CI2 input selection */
#define SYSCFG_TIMER1_CI3_SEL               BITS(28,31)                                     /*!< TIMER1_CI3 input selection */

/* SYSCFG_CFG5 bits definitions */
#define SYSCFG_CFG5_LOCKUP_LOCK             BIT(0)                                          /*!< CPU lockup (Hardfault) output enable */
#define SYSCFG_CFG5_LVD_LOCK                BIT(1)                                          /*!< Low voltage detector lock */
#define SYSCFG_CFG5_SRAM_LOCK               BIT(2)                                          /*!< SRAM ECC multi-bit error lock */
#define SYSCFG_CFG5_CANRX_LOCK              BIT(3)                                          /*!< CAN receive FIFO ECC multi-bit error lock */
#define SYSCFG_CFG5_CANFILTER_LOCK          BIT(4)                                          /*!< CAN filter ECC multi-bit error lock */
#define SYSCFG_CFG5_FLASHSRAM_LOCK          BIT(5)                                          /*!< Flash SRAM ECC multi-bit error lock */
#define SYSCFG_CFG5_FLASH_LOCK              BIT(6)                                          /*!< Flash ECC multi-bit error lock */

/* SYSCFG_SRAMCFG bits definitions */
#define SYSCFG_SRAMCFG_SRAM_REMAP_SEL       BITS(0,1)                                       /*!< The size of SRAM aliased */

/* SYSCFG_PRCFG bits definitions */
#define SYSCFG_PRCFG_PRCFG0                 BIT(0)                                          /*!< Protect configuration select 0 */
#define SYSCFG_PRCFG_PRCFG1                 BIT(1)                                          /*!< Protect configuration select 1 */
#define SYSCFG_PRCFG_PRCFG2                 BIT(3)                                          /*!< Protect configuration select 2 */
#define SYSCFG_PRCFG_PRKEY                  BITS(8,15)                                      /*!< Protect KEY */

/* SYSCFG_TADSRCFG bits definitions */
#define SYSCFG_TADSRCFG_ADCSM1SEL           BITS(0,3)                                       /*!< Select the ADC trigger source connected to ADCSM1 pin. */
#define SYSCFG_TADSRCFG_ADCSM1EN            BIT(7)                                          /*!< ADCSM1 pin output enable */
#define SYSCFG_TADSRCFG_ADCSM2SEL           BITS(8,11)                                      /*!< Select the ADC trigger source connected to ADCSM2 pin. */
#define SYSCFG_TADSRCFG_ADCSM2EN            BIT(15)                                         /*!< ADCSM2 pin output enable */

/* SYSCFG_TIMERxCFG0(x=0,7/1,2) bits definitions */
#define SYSCFG_TIMERTRGCFG_TSCFG0           BITS(0,4)                                       /*!< Quadrature decoder mode 0 configuration */
#define SYSCFG_TIMERTRGCFG_TSCFG1           BITS(5,9)                                       /*!< Quadrature decoder mode 1 configuration */
#define SYSCFG_TIMERTRGCFG_TSCFG2           BITS(10,14)                                     /*!< Quadrature decoder mode 2 configuration */
#define SYSCFG_TIMERTRGCFG_TSCFG3           BITS(16,20)                                     /*!< Restart mode configuration */
#define SYSCFG_TIMERTRGCFG_TSCFG4           BITS(21,25)                                     /*!< Pause mode configuration */
#define SYSCFG_TIMERTRGCFG_TSCFG5           BITS(26,30)                                     /*!< Event mode configuration */

/* SYSCFG_TIMERxCFG1(x=0,7/1,2) bits definitions */
#define SYSCFG_TIMERTRGCFG_TSCFG6           BITS(0,4)                                       /*!< External clock mode 0 configuration */
#define SYSCFG_TIMERTRGCFG_TSCFG7           BITS(5,9)                                       /*!< Restart + event mode configuration */
#define SYSCFG_TIMERTRGCFG_TSCFG9           BITS(16,20)                                     /*!< Decoder mode 0 configuration */
#define SYSCFG_TIMERTRGCFG_TSCFG10          BITS(21,25)                                     /*!< Decoder mode 1 configuration */
#define SYSCFG_TIMERTRGCFG_TSCFG11          BITS(26,30)                                     /*!< Decoder mode 2 configuration */

/* SYSCFG_TIMERxCFG2(x=0,7/1,2) bits definitions */
#define SYSCFG_TIMERTRGCFG_TSCFG12          BITS(0,4)                                       /*!< Decoder mode 3 configuration */
#define SYSCFG_TIMERTRGCFG_TSCFG15          BITS(16,20)                                     /*!< Internal trigger input source configuration */

/* SYSCFG_CFG6 bits definitions */
#define SYSCFG_CFG6_CK_CMP_SEL              BIT(0)                                          /*!< CK_CMP select */


/* constants definitions */
/* define the SYSCFG_REGIDX_BIT_VAL, include register index offset, bit position and value
*  [31:16] [15:8]  [7:0]
*  regidx  bitpos  value
*/
#define SYSCFG_REGIDX_BIT_VAL(regidx, bitpos, value)    (((uint32_t)(regidx) << 16U) | (uint32_t)((bitpos) << 8U) | ((uint32_t)(value)))
#define SYSCFG_REG_INDEX(val)                           (((uint32_t)(val) & 0xFFFF0000U) >> 16U)
#define SYSCFG_BIT_POS(val)                             (((uint32_t)(val) & 0x00001F00U) >> 8U)
#define SYSCFG_VALUE(val)                               ((uint32_t)(val) & 0x000000FFU)
#define SYSCFG_REG_VAL(offset)                          (REG32(SYSCFG + (((uint32_t)(offset) & 0xFFFF0000U) >> 16U)))

/* register offset */
#define SYSCFG_CFG0_OFFSET              0x00000000U                     /*!< SYSCFG_CFG0          offset */
#define SYSCFG_CFG1_OFFSET              0x00000004U                     /*!< SYSCFG_CFG1          offset */
#define SYSCFG_EXTISS0_OFFSET           0x00000008U                     /*!< SYSCFG_EXTISS0       offset */
#define SYSCFG_EXTISS1_OFFSET           0x0000000CU                     /*!< SYSCFG_EXTISS1       offset */
#define SYSCFG_EXTISS2_OFFSET           0x00000010U                     /*!< SYSCFG_EXTISS2       offset */
#define SYSCFG_EXTISS3_OFFSET           0x00000014U                     /*!< SYSCFG_EXTISS3       offset */
#define SYSCFG_STAT_OFFSET              0x0000001CU                     /*!< SYSCFG_STAT          offset */
#define SYSCFG_CFG2_OFFSET              0x00000020U                     /*!< SYSCFG_CFG2          offset */
#define SYSCFG_CFG3_OFFSET              0x00000024U                     /*!< SYSCFG_CFG3          offset */
#define SYSCFG_CFG4_OFFSET              0x00000028U                     /*!< SYSCFG_CFG4          offset */
#define SYSCFG_TIMERCISEL0_OFFSET       0x00000034U                     /*!< SYSCFG_TIMERCISEL0   offset */
#define SYSCFG_TIMERCISEL1_OFFSET       0x00000038U                     /*!< SYSCFG_TIMERCISEL1   offset */
#define SYSCFG_CFG5_OFFSET              0x00000054U                     /*!< SYSCFG_CFG5          offset */
#define SYSCFG_SRAMCFG_OFFSET           0x00000068U                     /*!< SYSCFG_SRAMCFG       offset */
#define SYSCFG_PRCFG_OFFSET             0x0000006CU                     /*!< SYSCFG_PRCFG         offset */
#define SYSCFG_TADSRCFG_OFFSET          0x00000070U                     /*!< SYSCFG_TADSRCFG      offset */
#define SYSCFG_TIMER0TRGCFG0_OFFSET     0x00000100U                     /*!< SYSCFG_TIMER0TRGCFG0 offset */
#define SYSCFG_TIMER0TRGCFG1_OFFSET     0x00000104U                     /*!< SYSCFG_TIMER0TRGCFG1 offset */
#define SYSCFG_TIMER0TRGCFG2_OFFSET     0x00000108U                     /*!< SYSCFG_TIMER0TRGCFG2 offset */
#define SYSCFG_TIMER1TRGCFG0_OFFSET     0x0000010CU                     /*!< SYSCFG_TIMER1TRGCFG0 offset */
#define SYSCFG_TIMER1TRGCFG1_OFFSET     0x00000110U                     /*!< SYSCFG_TIMER1TRGCFG1 offset */
#define SYSCFG_TIMER1TRGCFG2_OFFSET     0x00000114U                     /*!< SYSCFG_TIMER1TRGCFG2 offset */
#define SYSCFG_TIMER2TRGCFG0_OFFSET     0x00000118U                     /*!< SYSCFG_TIMER2TRGCFG0 offset */
#define SYSCFG_TIMER2TRGCFG1_OFFSET     0x0000011CU                     /*!< SYSCFG_TIMER2TRGCFG1 offset */
#define SYSCFG_TIMER2TRGCFG2_OFFSET     0x00000120U                     /*!< SYSCFG_TIMER2TRGCFG2 offset */
#define SYSCFG_TIMER7TRGCFG0_OFFSET     0x00000124U                     /*!< SYSCFG_TIMER7TRGCFG0 offset */
#define SYSCFG_TIMER7TRGCFG1_OFFSET     0x00000128U                     /*!< SYSCFG_TIMER7TRGCFG1 offset */
#define SYSCFG_TIMER7TRGCFG2_OFFSET     0x0000012CU                     /*!< SYSCFG_TIMER7TRGCFG2 offset */
#define SYSCFG_CFG6_OFFSET              0x00000204U                     /*!< SYSCFG_CFG6          offset */

