burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_syscfg.h
/* EXTI source GPIO definitions */
typedef enum {
    /* EXTI0_SS */
    EXTI_SOURCE_EXTI0_PA8       = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS0_OFFSET, 0, 0U),          /*!< EXTI0 PA8 configuration */
    EXTI_SOURCE_EXTI0_PC10      = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS0_OFFSET, 0, 1U),          /*!< EXTI0 PC10 configuration */
    EXTI_SOURCE_EXTI0_PN2       = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS0_OFFSET, 0, 2U),          /*!< EXTI0 PN2 configuration */
    EXTI_SOURCE_EXTI0_PC8       = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS0_OFFSET, 0, 3U),          /*!< EXTI0 PC8 configuration */
    /* EXTI1_SS */
    EXTI_SOURCE_EXTI1_PA9       = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS0_OFFSET, 4, 0U),          /*!< EXTI1 PA9 configuration */
    EXTI_SOURCE_EXTI1_PC11      = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS0_OFFSET, 4, 1U),          /*!< EXTI1 PC11 configuration */
    EXTI_SOURCE_EXTI1_PE13      = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS0_OFFSET, 4, 2U),          /*!< EXTI1 PE13 configuration */
    EXTI_SOURCE_EXTI1_PC9       = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS0_OFFSET, 4, 3U),          /*!< EXTI1 PC9 configuration */
    /* EXTI2_SS */
    EXTI_SOURCE_EXTI2_PA0       = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS0_OFFSET, 8, 0U),          /*!< EXTI2 PA0 configuration */
    EXTI_SOURCE_EXTI2_PC12      = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS0_OFFSET, 8, 1U),          /*!< EXTI2 PC12 configuration */
    EXTI_SOURCE_EXTI2_PF14      = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS0_OFFSET, 8, 2U),          /*!< EXTI2 PF14 configuration */
    EXTI_SOURCE_EXTI2_PG12      = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS0_OFFSET, 8, 3U),          /*!< EXTI2 PG12 configuration */
    /* EXTI3_SS */
    EXTI_SOURCE_EXTI3_PF12      = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS0_OFFSET, 12, 0U),         /*!< EXTI3 PF12 configuration */
    /* EXTI4_SS */
    EXTI_SOURCE_EXTI4_PA1       = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS1_OFFSET, 0, 0U),          /*!< EXTI4 PA1 configuration */
    EXTI_SOURCE_EXTI4_PE14      = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS1_OFFSET, 0, 1U),          /*!< EXTI4 PE14 configuration */
    EXTI_SOURCE_EXTI4_PF9       = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS1_OFFSET, 0, 2U),          /*!< EXTI4 PF9 configuration */
    EXTI_SOURCE_EXTI4_PF13      = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS1_OFFSET, 0, 3U),          /*!< EXTI4 PF13 configuration */
    /* EXTI5_SS */
    EXTI_SOURCE_EXTI5_PD8       = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS1_OFFSET, 4, 0U),          /*!< EXTI5 PD8 configuration */
    EXTI_SOURCE_EXTI5_PG14      = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS1_OFFSET, 4, 1U),          /*!< EXTI5 PG14 configuration */
    EXTI_SOURCE_EXTI5_PN7       = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS1_OFFSET, 4, 2U),          /*!< EXTI5 PN7 configuration */
    /* EXTI6_SS */
    EXTI_SOURCE_EXTI6_PB1       = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS1_OFFSET, 8, 0U),          /*!< EXTI6 PB1 configuration */
    EXTI_SOURCE_EXTI6_PC6       = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS1_OFFSET, 8, 1U),          /*!< EXTI6 PC6 configuration */
    EXTI_SOURCE_EXTI6_PD2       = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS1_OFFSET, 8, 2U),          /*!< EXTI6 PD2 configuration */
    EXTI_SOURCE_EXTI6_PG13      = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS1_OFFSET, 8, 3U),          /*!< EXTI6 PG13 configuration */
    /* EXTI7_SS */
    EXTI_SOURCE_EXTI7_PB0       = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS1_OFFSET, 12, 0U),         /*!< EXTI7 PB0 configuration */
    EXTI_SOURCE_EXTI7_PC7       = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS1_OFFSET, 12, 1U),         /*!< EXTI7 PC7 configuration */
    EXTI_SOURCE_EXTI7_PN5       = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS1_OFFSET, 12, 2U),         /*!< EXTI7 PN5 configuration */
    /* EXTI8_SS */
    EXTI_SOURCE_EXTI8_PD4       = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS2_OFFSET, 0, 0U),          /*!< EXTI8 PD4 configuration */
    EXTI_SOURCE_EXTI8_PE8       = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS2_OFFSET, 0, 1U),          /*!< EXTI8 PE8 configuration */
    EXTI_SOURCE_EXTI8_PF8       = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS2_OFFSET, 0, 2U),          /*!< EXTI8 PF8 configuration */
    EXTI_SOURCE_EXTI8_PG15      = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS2_OFFSET, 0, 3U),          /*!< EXTI8 PG15 configuration */
    /* EXTI9_SS */
    EXTI_SOURCE_EXTI9_PD5       = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS2_OFFSET, 4, 0U),          /*!< EXTI9 PD5 configuration */
    EXTI_SOURCE_EXTI9_PD9       = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS2_OFFSET, 4, 1U),          /*!< EXTI9 PD9 configuration */
    EXTI_SOURCE_EXTI9_PE9       = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS2_OFFSET, 4, 2U),          /*!< EXTI9 PE9 configuration */
    EXTI_SOURCE_EXTI9_PF11      = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS2_OFFSET, 4, 3U),          /*!< EXTI9 PF11 configuration */
    /* EXTI10_SS */
    EXTI_SOURCE_EXTI10_PB2      = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS2_OFFSET, 8, 0U),          /*!< EXTI10 PB2 configuration */
    EXTI_SOURCE_EXTI10_PC0      = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS2_OFFSET, 8, 1U),          /*!< EXTI10 PC0 configuration */
    EXTI_SOURCE_EXTI10_PD10     = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS2_OFFSET, 8, 2U),          /*!< EXTI10 PD10 configuration */
    EXTI_SOURCE_EXTI10_PE10     = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS2_OFFSET, 8, 3U),          /*!< EXTI10 PE10 configuration */
    EXTI_SOURCE_EXTI10_PF10     = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS2_OFFSET, 8, 4U),          /*!< EXTI10 PF10 configuration */
    /* EXTI11_SS */
    EXTI_SOURCE_EXTI11_PC1      = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS2_OFFSET, 12, 0U),         /*!< EXTI11 PC1 configuration */
    EXTI_SOURCE_EXTI11_PD11     = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS2_OFFSET, 12, 1U),         /*!< EXTI11 PD11 configuration */
    EXTI_SOURCE_EXTI11_PG11     = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS2_OFFSET, 12, 2U),         /*!< EXTI11 PG11 configuration */
    /* EXTI12_SS */
    EXTI_SOURCE_EXTI12_PC2      = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS3_OFFSET, 0, 0U),          /*!< EXTI12 PC2 configuration */
    EXTI_SOURCE_EXTI12_PD12     = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS3_OFFSET, 0, 1U),          /*!< EXTI12 PD12 configuration */
    EXTI_SOURCE_EXTI12_PE12     = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS3_OFFSET, 0, 2U),          /*!< EXTI12 PE12 configuration */
    /* EXTI13_SS */
    EXTI_SOURCE_EXTI13_PC3      = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS3_OFFSET, 4, 0U),          /*!< EXTI13 PC3 configuration */
    EXTI_SOURCE_EXTI13_PD13     = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS3_OFFSET, 4, 1U),          /*!< EXTI13 PD13 configuration */
    /* EXTI14_SS */
    EXTI_SOURCE_EXTI14_PB14     = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS3_OFFSET, 8, 0U),          /*!< EXTI14 PB14 configuration */
    EXTI_SOURCE_EXTI14_PC4      = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS3_OFFSET, 8, 1U),          /*!< EXTI14 PC4 configuration */
    EXTI_SOURCE_EXTI14_PD14     = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS3_OFFSET, 8, 2U),          /*!< EXTI14 PD14 configuration */
    EXTI_SOURCE_EXTI14_PE11     = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS3_OFFSET, 8, 3U),          /*!< EXTI14 PE11 configuration */
    /* EXTI15_SS */
    EXTI_SOURCE_EXTI15_PB15     = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS3_OFFSET, 12, 0U),         /*!< EXTI15 PB15 configuration */
    EXTI_SOURCE_EXTI15_PC5      = SYSCFG_REGIDX_BIT_VAL(SYSCFG_EXTISS3_OFFSET, 12, 1U),         /*!< EXTI15 PC5 configuration */
} exti_gpio_enum;

/* peripheral interrupt */
typedef enum {
    /* ECC */
    SYSCFG_INT_ECC_ME0          = SYSCFG_REGIDX_BIT_VAL(SYSCFG_CFG2_OFFSET, 0, 0U),           /*!< SRAM multi-bit non-correction interrupt enable */
    SYSCFG_INT_ECC_SE0          = SYSCFG_REGIDX_BIT_VAL(SYSCFG_CFG2_OFFSET, 1, 0U),           /*!< SRAM single-bit correction interrupt enable */
    SYSCFG_INT_ECC_ME1          = SYSCFG_REGIDX_BIT_VAL(SYSCFG_CFG3_OFFSET, 0, 0U),           /*!< CAN receive FIFO multi-bit non-correction interrupt enable */
    SYSCFG_INT_ECC_SE1          = SYSCFG_REGIDX_BIT_VAL(SYSCFG_CFG3_OFFSET, 1, 0U),           /*!< CAN receive FIFO single-bit correction interrupt enable */
    SYSCFG_INT_ECC_ME2          = SYSCFG_REGIDX_BIT_VAL(SYSCFG_CFG3_OFFSET, 2, 0U),           /*!< CAN filter SRAM multi-bit non-correction interrupt enable */
    SYSCFG_INT_ECC_SE2          = SYSCFG_REGIDX_BIT_VAL(SYSCFG_CFG3_OFFSET, 3, 0U),           /*!< CAN filter SRAM single-bit correction interrupt enable */
    SYSCFG_INT_ECC_ME3          = SYSCFG_REGIDX_BIT_VAL(SYSCFG_CFG4_OFFSET, 0, 0U),           /*!< Flash SRAM multi-bit non-correction interrupt enable */
    SYSCFG_INT_ECC_SE3          = SYSCFG_REGIDX_BIT_VAL(SYSCFG_CFG4_OFFSET, 1, 0U),           /*!< Flash SRAM single-bit correction interrupt enable */
    SYSCFG_INT_ECC_ME4          = SYSCFG_REGIDX_BIT_VAL(SYSCFG_CFG4_OFFSET, 2, 0U),           /*!< Flash multi-bit non-correction interrupt enable */
    /* NMI */
    SYSCFG_INT_NMI_HXTAL        = SYSCFG_REGIDX_BIT_VAL(SYSCFG_CFG2_OFFSET, 3, 0U),           /*!< HXTAL clock monitor NMI interrupt enable */
    SYSCFG_INT_NMI_PIN          = SYSCFG_REGIDX_BIT_VAL(SYSCFG_CFG2_OFFSET, 4, 0U),           /*!< NMI pin interrupt enable */
    SYSCFG_INT_NMI_WWDGT        = SYSCFG_REGIDX_BIT_VAL(SYSCFG_CFG2_OFFSET, 6, 0U),           /*!< WWDGT NMI interrupt enable*/
    SYSCFG_INT_NMI_FWDGT        = SYSCFG_REGIDX_BIT_VAL(SYSCFG_CFG2_OFFSET, 7, 0U),           /*!< FWDGT NMI interrupt enable*/
    SYSCFG_INT_NMI_LVD2         = SYSCFG_REGIDX_BIT_VAL(SYSCFG_CFG2_OFFSET, 8, 0U),           /*!< LVD2 NMI interrupt enable*/
    SYSCFG_INT_NMI_LVD1         = SYSCFG_REGIDX_BIT_VAL(SYSCFG_CFG2_OFFSET, 9, 0U),           /*!< LVD1 NMI interrupt enable*/
} syscfg_interrupt_enum;

