burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_syscfg.h
/* peripheral interrupt flag */
#define SYSCFG_INT_FLAG_ECC_ME0             SYSCFG_STAT_ECCMEIF0                              /*!< SRAM multi-bit error flag */
#define SYSCFG_INT_FLAG_ECC_SE0             SYSCFG_STAT_ECCSEIF0                              /*!< SRAM single-bit error flag */
#define SYSCFG_INT_FLAG_ECC_ME1             SYSCFG_STAT_ECCMEIF1                              /*!< CAN FIFO SRAM multi-bit error flag */
#define SYSCFG_INT_FLAG_ECC_SE1             SYSCFG_STAT_ECCSEIF1                              /*!< CAN FIFO SRAM single-bit error flag */
#define SYSCFG_INT_FLAG_ECC_ME2             SYSCFG_STAT_ECCMEIF2                              /*!< CAN filter SRAM multi-bit error flag */
#define SYSCFG_INT_FLAG_ECC_SE2             SYSCFG_STAT_ECCSEIF2                              /*!< CAN filter SRAM single-bit error flag */
#define SYSCFG_INT_FLAG_ECC_ME3             SYSCFG_STAT_ECCMEIF3                              /*!< Flash SRAM multi-bit error flag */
#define SYSCFG_INT_FLAG_ECC_SE3             SYSCFG_STAT_ECCSEIF3                              /*!< Flash SRAM single-bit error flag */
#define SYSCFG_INT_FLAG_ECC_ME4             SYSCFG_STAT_ECCMEIF4                              /*!< Flash multi-bit error flag */
#define SYSCFG_INT_FLAG_NMI_HXTAL           SYSCFG_STAT_HXTAL_NMIIF                           /*!< HXTAL clock monitor NMI interrupt flag */
#define SYSCFG_INT_FLAG_NMI_PIN             SYSCFG_STAT_PIN_NMIIF                             /*!< NMI pin interrupt flag */
#define SYSCFG_INT_FLAG_NMI_WWDGT           SYSCFG_STAT_WWDGT_NMIIF                           /*!< WWDGT NMI interrupt flag */
#define SYSCFG_INT_FLAG_NMI_FWDGT           SYSCFG_STAT_FWDGT_NMIIF                           /*!< FWDGT NMI interrupt flag */

/* TIMERx A/D conversion start request select definitions */
typedef enum {
    /* ADCSM1 pin */
    SYSCFG_ADCSM1_TIMER0_TRGOF  = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TADSRCFG_OFFSET, 0, 0U),     /*!< ADCSM1 Source of monitor is TIMER0_TRGOF */
    SYSCFG_ADCSM1_TIMER0_TRGUF  = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TADSRCFG_OFFSET, 0, 1U),     /*!< ADCSM1 Source of monitor is TIMER0_TRGUF */
    SYSCFG_ADCSM1_TIMER0_TRGA   = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TADSRCFG_OFFSET, 0, 2U),     /*!< ADCSM1 Source of monitor is TIMER0_TRGA  */
    SYSCFG_ADCSM1_TIMER0_TRGB   = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TADSRCFG_OFFSET, 0, 3U),     /*!< ADCSM1 Source of monitor is TIMER0_TRGB  */
    SYSCFG_ADCSM1_TIMER0_TRGAB  = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TADSRCFG_OFFSET, 0, 4U),     /*!< ADCSM1 Source of monitor is TIMER0_TRGAB */
    SYSCFG_ADCSM1_TIMER7_TRGOF  = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TADSRCFG_OFFSET, 0, 5U),     /*!< ADCSM1 Source of monitor is TIMER7_TRGOF */
    SYSCFG_ADCSM1_TIMER7_TRGUF  = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TADSRCFG_OFFSET, 0, 6U),     /*!< ADCSM1 Source of monitor is TIMER7_TRGUF */
    SYSCFG_ADCSM1_TIMER7_TRGA   = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TADSRCFG_OFFSET, 0, 7U),     /*!< ADCSM1 Source of monitor is TIMER7_TRGA  */
    SYSCFG_ADCSM1_TIMER7_TRGB   = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TADSRCFG_OFFSET, 0, 8U),     /*!< ADCSM1 Source of monitor is TIMER7_TRGB  */
    SYSCFG_ADCSM1_TIMER7_TRGAB  = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TADSRCFG_OFFSET, 0, 9U),     /*!< ADCSM1 Source of monitor is TIMER7_TRGAB */
    /* ADCSM2 pin */
    SYSCFG_ADCSM2_TIMER0_TRGOF  = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TADSRCFG_OFFSET, 8, 0U),     /*!< ADCSM2 Source of monitor is TIMER0_TRGOF */
    SYSCFG_ADCSM2_TIMER0_TRGUF  = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TADSRCFG_OFFSET, 8, 1U),     /*!< ADCSM2 Source of monitor is TIMER0_TRGUF */
    SYSCFG_ADCSM2_TIMER0_TRGA   = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TADSRCFG_OFFSET, 8, 2U),     /*!< ADCSM2 Source of monitor is TIMER0_TRGA  */
    SYSCFG_ADCSM2_TIMER0_TRGB   = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TADSRCFG_OFFSET, 8, 3U),     /*!< ADCSM2 Source of monitor is TIMER0_TRGB  */
    SYSCFG_ADCSM2_TIMER0_TRGAB  = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TADSRCFG_OFFSET, 8, 4U),     /*!< ADCSM2 Source of monitor is TIMER0_TRGAB */
    SYSCFG_ADCSM2_TIMER7_TRGOF  = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TADSRCFG_OFFSET, 8, 5U),     /*!< ADCSM2 Source of monitor is TIMER7_TRGOF */
    SYSCFG_ADCSM2_TIMER7_TRGUF  = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TADSRCFG_OFFSET, 8, 6U),     /*!< ADCSM2 Source of monitor is TIMER7_TRGUF */
    SYSCFG_ADCSM2_TIMER7_TRGA   = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TADSRCFG_OFFSET, 8, 7U),     /*!< ADCSM2 Source of monitor is TIMER7_TRGA  */
    SYSCFG_ADCSM2_TIMER7_TRGB   = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TADSRCFG_OFFSET, 8, 8U),     /*!< ADCSM2 Source of monitor is TIMER7_TRGB  */
    SYSCFG_ADCSM2_TIMER7_TRGAB  = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TADSRCFG_OFFSET, 8, 9U),     /*!< ADCSM2 Source of monitor is TIMER7_TRGAB */
} syscfg_adcsm_enum;

/* TIMERx channel input Select definitions */
typedef enum {
    TIMER7_CI0_INPUT_TIMER7_CH0     = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL0_OFFSET, 0,  0U),      /*!< select TIMER7 CH0 as TIMER7 CI0 */
    TIMER7_CI0_INPUT_CMP1_OUT       = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL0_OFFSET, 0,  1U),      /*!< select CMP1 output as TIMER7 CI0 */
    TIMER7_CI1_INPUT_TIMER7_CH1     = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL0_OFFSET, 4,  0U),      /*!< select TIMER7 CH1 as TIMER7 CI1 */
    TIMER7_CI2_INPUT_TIMER7_CH2     = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL0_OFFSET, 8,  0U),      /*!< select TIMER7 CH2 as TIMER7 CI2 */
    TIMER7_CI3_INPUT_TIMER7_CH3     = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL0_OFFSET, 12, 0U),      /*!< select TIMER7 CH3 as TIMER7 CI3 */
    TIMER0_CI0_INPUT_TIMER0_CH0     = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL0_OFFSET, 16, 0U),      /*!< select TIMER0 CH0 as TIMER0 CI0 */
    TIMER0_CI0_INPUT_CMP0_OUT       = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL0_OFFSET, 16, 1U),      /*!< select CMP0 output as TIMER0 CI0 */
    TIMER0_CI1_INPUT_TIMER0_CH1     = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL0_OFFSET, 20, 0U),      /*!< select TIMER0 CH1 as TIMER0 CI1 */
    TIMER0_CI2_INPUT_TIMER0_CH2     = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL0_OFFSET, 24, 0U),      /*!< select TIMER0 CH2 as TIMER0 CI2 */
    TIMER0_CI3_INPUT_TIMER0_CH3     = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL0_OFFSET, 28, 0U),      /*!< select TIMER0 CH3 as TIMER0 CI3 */
    TIMER2_CI0_INPUT_TIMER2_CH0     = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL1_OFFSET, 0,  0U),      /*!< select TIMER2 CH0 as TIMER2 CI0 */
    TIMER2_CI0_INPUT_CMP0_OUT       = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL1_OFFSET, 0,  1U),      /*!< select CMP0 output as TIMER2 CI0 */
    TIMER2_CI0_INPUT_CMP1_OUT       = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL1_OFFSET, 0,  2U),      /*!< select CMP1 output as TIMER2 CI0 */
    TIMER2_CI0_INPUT_CMP0_1_OUT     = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL1_OFFSET, 0,  3U),      /*!< select CMP0 and CMP1 output as TIMER2 CI0 */
    TIMER2_CI0_INPUT_EXT_TRIGGER0   = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL1_OFFSET, 0,  8U),      /*!< select external trigger 0 as TIMER2 CI0 */
    TIMER2_CI0_INPUT_EXT_TRIGGER1   = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL1_OFFSET, 0,  9U),      /*!< select external trigger 1 as TIMER2 CI0 */
    TIMER2_CI0_INPUT_EXT_TRIGGER2   = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL1_OFFSET, 0,  10U),     /*!< select external trigger 2 as TIMER2 CI0 */
    TIMER2_CI0_INPUT_EXT_TRIGGER3   = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL1_OFFSET, 0,  11U),     /*!< select external trigger 3 as TIMER2 CI0 */
    TIMER2_CI1_INPUT_TIMER2_CH1     = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL1_OFFSET, 4,  0U),      /*!< select TIMER2 CH1 as TIMER2 CI1 */
    TIMER2_CI1_INPUT_EXT_TRIGGER0   = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL1_OFFSET, 4,  8U),      /*!< select external trigger 0 as TIMER2 CI1 */
    TIMER2_CI1_INPUT_EXT_TRIGGER1   = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL1_OFFSET, 4,  9U),      /*!< select external trigger 1 as TIMER2 CI1 */
    TIMER2_CI1_INPUT_EXT_TRIGGER2   = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL1_OFFSET, 4,  10U),     /*!< select external trigger 2 as TIMER2 CI1 */
    TIMER2_CI1_INPUT_EXT_TRIGGER3   = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL1_OFFSET, 4,  11U),     /*!< select external trigger 3 as TIMER2 CI1 */
    TIMER2_CI2_INPUT_TIMER2_CH2     = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL1_OFFSET, 8,  0U),      /*!< select TIMER2 CH2 as TIMER2 CI2 */
    TIMER2_CI3_INPUT_TIMER2_CH3     = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL1_OFFSET, 12, 0U),      /*!< select TIMER2 CH3 as TIMER2 CI3 */
    TIMER2_CI3_INPUT_IRC32K         = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL1_OFFSET, 12, 14U),     /*!< select IRC32K as TIMER2 CI3 */
    TIMER2_CI3_INPUT_CK_OUT         = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL1_OFFSET, 12, 15U),     /*!< select Clock out as TIMER2 CI3 */
    TIMER1_CI0_INPUT_TIMER1_CH0     = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL1_OFFSET, 16, 0U),      /*!< select TIMER1 CH0 as TIMER1 CI0 */
    TIMER1_CI0_INPUT_EXT_TRIGGER0   = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL1_OFFSET, 16, 8U),      /*!< select external trigger 0 as TIMER1 CI0 */
    TIMER1_CI0_INPUT_EXT_TRIGGER1   = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL1_OFFSET, 16, 9U),      /*!< select external trigger 1 as TIMER1 CI0 */
    TIMER1_CI0_INPUT_EXT_TRIGGER2   = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL1_OFFSET, 16, 10U),     /*!< select external trigger 2 as TIMER1 CI0 */
    TIMER1_CI0_INPUT_EXT_TRIGGER3   = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL1_OFFSET, 16, 11U),     /*!< select external trigger 3 as TIMER1 CI0 */
    TIMER1_CI1_INPUT_TIMER1_CH1     = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL1_OFFSET, 20, 0U),      /*!< select TIMER1 CH1 as TIMER1 CI1 */
    TIMER1_CI1_INPUT_EXT_TRIGGER0   = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL1_OFFSET, 20, 8U),      /*!< select external trigger 0 as TIMER1 CI1 */
    TIMER1_CI1_INPUT_EXT_TRIGGER1   = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL1_OFFSET, 20, 9U),      /*!< select external trigger 1 as TIMER1 CI1 */
    TIMER1_CI1_INPUT_EXT_TRIGGER2   = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL1_OFFSET, 20, 10U),     /*!< select external trigger 2 as TIMER1 CI1 */
    TIMER1_CI1_INPUT_EXT_TRIGGER3   = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL1_OFFSET, 20, 11U),     /*!< select external trigger 3 as TIMER1 CI1 */
    TIMER1_CI2_INPUT_TIMER1_CH2     = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL1_OFFSET, 24, 0U),      /*!< select TIMER1 CH2 as TIMER1 CI2 */
    TIMER1_CI3_INPUT_TIMER1_CH3     = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL1_OFFSET, 28, 0U),      /*!< select TIMER1 CH3 as TIMER1 CI3 */
    TIMER1_CI3_INPUT_CMP0_OUT       = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL1_OFFSET, 28, 1U),      /*!< select CMP0 output as TIMER1 CI3 */
    TIMER1_CI3_INPUT_CMP1_OUT       = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL1_OFFSET, 28, 2U),      /*!< select CMP1 output as TIMER1 CI3 */
    TIMER1_CI3_INPUT_CMP0_1_OUT     = SYSCFG_REGIDX_BIT_VAL(SYSCFG_TIMERCISEL1_OFFSET, 28, 3U),      /*!< select CMP0 and CMP1 output as TIMER1 CI3 */
} timer_channel_input_enum;

/* boot mode */
#define SYSCFG_BOOT_SYSTEM_MEMORY           ((uint32_t)0x00U)                           /*!< Boot from the system memory  */
#define SYSCFG_BOOT_MAIN_FLASH              ((uint32_t)0x01U)                           /*!< boot from the main flash */

/* module lockup */
#define SYSCFG_LOCKUP_LOCKUP                SYSCFG_CFG5_LOCKUP_LOCK                     /*!< CPU lockup (Hardfault) output enable */
#define SYSCFG_LVD_LOCKUP                   SYSCFG_CFG5_LVD_LOCK                        /*!< Low voltage detector lock */
#define SYSCFG_SRAM_LOCKUP                  SYSCFG_CFG5_SRAM_LOCK                       /*!< SRAM ECC multi-bit error lock */
#define SYSCFG_CANRX_LOCK                   SYSCFG_CFG5_CANRX_LOCK                      /*!< CAN receive FIFO ECC multi-bit error lock */
#define SYSCFG_CANFILTER_LOCK               SYSCFG_CFG5_CANFILTER_LOCK                  /*!< CAN filter ECC multi-bit error lock */
#define SYSCFG_FLASHSRAM_LOCK               SYSCFG_CFG5_FLASHSRAM_LOCK                  /*!< Flash SRAM ECC multi-bit error lock */
#define SYSCFG_FLASH_LOCKUP                 SYSCFG_CFG5_FLASH_LOCK                      /*!< Flash ECC multi-bit error lock */

/* SRAM remap size definitions */
#define SRAM_REMAP_SIZE_0KB                 ((uint32_t)0x00000000U)                     /*!< SRAM Remap 0KB to 0x10000000 */
#define SRAM_REMAP_SIZE_8KB                 ((uint32_t)0x00000001U)                     /*!< SRAM Remap 8KB to 0x10000000 */
#define SRAM_REMAP_SIZE_16KB                ((uint32_t)0x00000002U)                     /*!< SRAM Remap 16KB to 0x10000000 */
#define SRAM_REMAP_SIZE_32KB                ((uint32_t)0x00000003U)                     /*!< SRAM Remap 32KB to 0x10000000 */

/* Register Write Protection definitions */
#define SYSCFG_WRITE_PROTECTION_KEY         ((uint32_t)0xA500U)                         /*!< Registers Write Protection KEY */
#define SYSCFG_WRITE_PROTECTION_REG0        SYSCFG_PRCFG_PRCFG0                         /*!< Registers Write Protection related to the clock generation circuit */
#define SYSCFG_WRITE_PROTECTION_REG1        SYSCFG_PRCFG_PRCFG1                         /*!< Registers Write Protection related to  Operating modes/ low power consumption/clock generation/Software reset registers*/
#define SYSCFG_WRITE_PROTECTION_REG2        SYSCFG_PRCFG_PRCFG2                         /*!< Registers Write Protection related to the LVD */

/* ADC signal monitor output */
#define SYSCFG_TADSRCFG_ADCSM1              SYSCFG_TADSRCFG_ADCSM1EN                    /*!< ADCSM1 pin output */
#define SYSCFG_TADSRCFG_ADCSM2              SYSCFG_TADSRCFG_ADCSM2EN                    /*!< ADCSM2 pin output */

/* timer trigger source select definition */
#define TIMER_SMCFG_TRGSEL_NONE             ((uint8_t)0x00U)                            /*!< trigger input is none */
#define TIMER_SMCFG_TRGSEL_ITI0             ((uint8_t)0x01U)                            /*!< internal trigger input 0 */
#define TIMER_SMCFG_TRGSEL_ITI1             ((uint8_t)0x02U)                            /*!< internal trigger input 1 */
#define TIMER_SMCFG_TRGSEL_ITI2             ((uint8_t)0x03U)                            /*!< internal trigger input 2 */
#define TIMER_SMCFG_TRGSEL_ITI3             ((uint8_t)0x04U)                            /*!< internal trigger input 3 */
#define TIMER_SMCFG_TRGSEL_CI0F_ED          ((uint8_t)0x05U)                            /*!< TI0 edge detector */
#define TIMER_SMCFG_TRGSEL_CI0FE0           ((uint8_t)0x06U)                            /*!< filtered TIMER input 0 */
#define TIMER_SMCFG_TRGSEL_CI1FE1           ((uint8_t)0x07U)                            /*!< filtered TIMER input 1 */
#define TIMER_SMCFG_TRGSEL_ETIFP            ((uint8_t)0x08U)                            /*!< external trigger */
#define TIMER_SMCFG_TRGSEL_CI2FE2           ((uint8_t)0x09U)                            /*!< filtered TIMER input 2 */
#define TIMER_SMCFG_TRGSEL_CI3FE3           ((uint8_t)0x0AU)                            /*!< filtered TIMER input 3 */
#define TIMER_SMCFG_TRGSEL_MCI0FEM0         ((uint8_t)0x0BU)                            /*!< filtered output of multi mode channel 0 input */
#define TIMER_SMCFG_TRGSEL_MCI1FEM1         ((uint8_t)0x0CU)                            /*!< filtered output of multi mode channel 1 input */
#define TIMER_SMCFG_TRGSEL_MCI2FEM2         ((uint8_t)0x0DU)                            /*!< filtered output of multi mode channel 2 input */
#define TIMER_SMCFG_TRGSEL_MCI3FEM3         ((uint8_t)0x0EU)                            /*!< filtered output of multi mode channel 3 input */

/* timer trigger mode select definition */
#define TIMER_QUAD_DECODER_MODE0            ((uint8_t)0x00U)                            /*!< quadrature decoder mode 0 */
#define TIMER_QUAD_DECODER_MODE1            ((uint8_t)0x01U)                            /*!< quadrature decoder mode 1 */
#define TIMER_QUAD_DECODER_MODE2            ((uint8_t)0x02U)                            /*!< quadrature decoder mode 2 */
#define TIMER_SLAVE_MODE_RESTART            ((uint8_t)0x03U)                            /*!< restart mode */
#define TIMER_SLAVE_MODE_PAUSE              ((uint8_t)0x04U)                            /*!< pause mode */
#define TIMER_SLAVE_MODE_EVENT              ((uint8_t)0x05U)                            /*!< event mode */
#define TIMER_SLAVE_MODE_EXTERNAL0          ((uint8_t)0x06U)                            /*!< external clock mode 0 */
#define TIMER_SLAVE_MODE_RESTART_EVENT      ((uint8_t)0x07U)                            /*!< restart + event mode */
#define TIMER_SLAVE_MODE_RESTART_PAUSE      ((uint8_t)0x08U)                            /*!< restart + pause mode */
#define TIMER_NONQUAD_DECODER_MODE0         ((uint8_t)0x09U)                            /*!< non-quadrature decoder mode 0 */
#define TIMER_NONQUAD_DECODER_MODE1         ((uint8_t)0x0AU)                            /*!< non-quadrature decoder mode 1 */
#define TIMER_NONQUAD_DECODER_MODE2         ((uint8_t)0x0BU)                            /*!< non-quadrature decoder mode 2 */
#define TIMER_NONQUAD_DECODER_MODE3         ((uint8_t)0x0CU)                            /*!< non-quadrature decoder mode 3 */
#define TIMER_QUAD_DECODER_MODE3            ((uint8_t)0x0DU)                            /*!< quadrature decoder mode 3 */
#define TIMER_QUAD_DECODER_MODE4            ((uint8_t)0x0EU)                            /*!< quadrature decoder mode 4 */
#define TIMER_SLAVE_MODE_DISABLE            ((uint8_t)0x0FU)                            /*!< slave mode disable */

/* definition of syscfg_timerx */
#define SYSCFG_TIMER0                       ((uint8_t)0x00U)                            /*!< SYSCFG TIMER0 */
#define SYSCFG_TIMER1                       ((uint8_t)0x01U)                            /*!< SYSCFG TIMER1 */
#define SYSCFG_TIMER2                       ((uint8_t)0x02U)                            /*!< SYSCFG TIMER2 */
#define SYSCFG_TIMER7                       ((uint8_t)0x03U)                            /*!< SYSCFG TIMER7 */

#define SYSCFG_TIMERCFG0(syscfg_timerx)     (SYSCFG + 0x100U + (syscfg_timerx) * 0x0CU)   /*!< TIMERx(x=0/1/2/7) configuration register0 base address */
#define SYSCFG_TIMERCFG1(syscfg_timerx)     (SYSCFG + 0x104U + (syscfg_timerx) * 0x0CU)   /*!< TIMERx(x=0/1/2/7) configuration register1 base address */
#define SYSCFG_TIMERCFG2(syscfg_timerx)     (SYSCFG + 0x108U + (syscfg_timerx) * 0x0CU)   /*!< TIMERx(x=0/1/2/7) configuration register2 base address */

