burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_syscfg.h
#define SYSCFG_TIMERXCFG0(syscfg_timerx)    REG32(SYSCFG_TIMERCFG0(syscfg_timerx))   /*!< TIMERx(x=0/1/2/7) configuration register0 */
#define SYSCFG_TIMERXCFG1(syscfg_timerx)    REG32(SYSCFG_TIMERCFG1(syscfg_timerx))   /*!< TIMERx(x=0/1/2/7) configuration register1 */
#define SYSCFG_TIMERXCFG2(syscfg_timerx)    REG32(SYSCFG_TIMERCFG2(syscfg_timerx))   /*!< TIMERx(x=0/1/2/7) configuration register2 */

/* CK_CMP Selection definitions */
typedef enum {
    CK_CMP_DIV2     = 0U,      /*!< CK_CMP=fPCLK/2 */
    CK_CMP_DIV4     = 1U,      /*!< CK_CMP=fPCLK/4 */
} ck_cmp_sel_enum;


/* function declarations */
/* initialization functions */
/* reset the SYSCFG registers */
void syscfg_deinit(void);

/* enable I2Cfast mode plus */
void syscfg_i2c_fast_mode_plus_enable(void);
/* disable I2C fast mode plus */
void syscfg_i2c_fast_mode_plus_disable(void);
/* configure the GPIO pin as EXTI Line */
void syscfg_exti_line_config(exti_gpio_enum exti_gpio);
/* select timer channel input source */
void syscfg_timer_input_source_select(timer_channel_input_enum timer_input);
/* enable module lockup function (function can be disabled by system reset) */
void syscfg_lockup_enable(uint32_t lockup);
/* set SRAM remap size */
void syscfg_sram_remap_set(uint32_t size);
/* get SRAM remap size */
uint32_t syscfg_sram_remap_size_get(void);
/* set CK_CMP selection */
void syscfg_ck_cmp_sel_set(ck_cmp_sel_enum sel);
/* get CK_CMP selection */
ck_cmp_sel_enum syscfg_ck_cmp_sel_get(void);

/* enable register write function */
void syscfg_register_write_enable(uint32_t wp_reg);
/* disable register write function */
void syscfg_register_write_disable(uint32_t wp_reg);

/* select ADC signal monitor */
void syscfg_adc_signal_monitor_select(syscfg_adcsm_enum timer_signal);
/* enable ADC signal monitor output */
void syscfg_adc_signal_monitor_output_enable(uint32_t adcsm);
/* disable ADC signal monitor output */
void syscfg_adc_signal_monitor_output_disable(uint32_t adcsm);

/* get boot mode */
uint32_t syscfg_boot_mode_get(void);
/* get sram ecc error address */
uint32_t syscfg_sram_ecc_error_address_get(void);
/* get sram ecc single-bit correction error bit */
uint8_t syscfg_sram_ecc_error_bit_get(void);

/* flag and interrupt functions */
/* enable the syscfg peripherals interrupt */
void syscfg_interrupt_enable(syscfg_interrupt_enum interrupt);
/* disable the syscfg peripherals interrupt */
void syscfg_interrupt_disable(syscfg_interrupt_enum interrupt);
/* get the interrupt flags */
FlagStatus syscfg_interrupt_flag_get(uint32_t int_flag);
/* clear the interrupt flags */
void syscfg_interrupt_flag_clear(uint32_t int_flag);

#endif /* GD32M53X_SYSCFG_H */
